# AxisNotSpecified Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..AxisNotSpecified Property
BuiltInFailures..::..SketchFailures Class See Also
---
Axis of revolution not specified.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AxisNotSpecified { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AxisNotSpecified As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AxisNotSpecified {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace